""" 
@author: zoutai
@file: testMoreDimAdd.py 
@time: 2018/12/19 
@description: 测试一个不同维数矩阵相加

对于[1,2,3,4]维+[1,4]，我希望是以最后一维4看齐，最终得[1,2,3,4]
结果验证是的：
"""
import numpy as np
arr = np.zeros((2,3,4))
arr = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]
arrA = np.reshape(arr,[1,2,3,4])
arrB = [-10,-20,-30,-40]
arrC = arrA +arrB
print("-----arrA：",arrA,"-----arrB：",arrB,"-----arrC：",arrC,sep='\n')

'''
output:

-----arrA：
[[[[ 1  2  3  4]
   [ 5  6  7  8]
   [ 9 10 11 12]]

  [[13 14 15 16]
   [17 18 19 20]
   [21 22 23 24]]]]
-----arrB：
[-10, -20, -30, -40]
-----arrC：
[[[[ -9 -18 -27 -36]
   [ -5 -14 -23 -32]
   [ -1 -10 -19 -28]]

  [[  3  -6 -15 -24]
   [  7  -2 -11 -20]
   [ 11   2  -7 -16]]]]
'''

